In [5]:
import pandas as pd

In [9]:
df = pd.read_csv("...\persona.csv")
df

      PRICE   SOURCE     SEX COUNTRY  AGE
0        39  android    male     bra   17
1        39  android    male     bra   17
2        49  android    male     bra   17
3        29  android    male     tur   17
4        49  android    male     tur   17
...     ...      ...     ...     ...  ...
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31

[5000 rows x 5 columns]

In [10]:
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

* § Soru 1: persona.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri gösteriniz.

In [11]:
def check_df(dataframe, head=5):         
    print("##################### Shape #####################")
    print(dataframe.shape)
    print("##################### Types #####################")
    print(dataframe.dtypes)
    print("##################### Head #####################")
    print(dataframe.head(head))
    print("##################### Tail #####################")
    print(dataframe.tail(head))
    print("##################### NA #####################")
    print(dataframe.isnull().sum())
    print("##################### Quantiles #####################")
    print(dataframe.describe([0, 0.05, 0.50, 0.95, 1]).T)

In [12]:
check_df(df)

##################### Shape #####################
(5000, 5)
##################### Types #####################
PRICE       int64
SOURCE     object
SEX        object
COUNTRY    object
AGE         int64
dtype: object
##################### Head #####################
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17
##################### Tail #####################
      PRICE   SOURCE     SEX COUNTRY  AGE
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
##################### NA #####################
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64
##################### Quantiles #####################
        count     mean        std   min    0%    5%   50%   95%  100%   max
PRICE  5000.0  34.1320  12.464897   9.0   9.0  19.0  39.0  49.0  59.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  15.0  15.0  21.0  43.0  66.0  66.0

* § Soru 2: Kaç unique SOURCE vardır? Frekansları nedir?

In [13]:
df["SOURCE"].unique()

array(['android', 'ios'], dtype=object)

In [14]:
df["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

* § Soru 3: Kaç unique PRICE vardır?

In [15]:
df["PRICE"].nunique()

6

* § Soru 4: Hangi PRICE'dan kaçar tane satış gerçekleşmiş?

In [16]:

df["COUNTRY"].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

* § Soru 5: Hangi ülkeden kaçar tane satış olmuş?

In [42]:
df.groupby("COUNTRY")["PRICE"].count()

COUNTRY
bra    1496
can     230
deu     455
fra     303
tur     451
usa    2065
Name: PRICE, dtype: int64

* § Soru 6: Ülkelere göre satışlardan toplam ne kadar kazanılmış?

In [46]:
df.groupby("COUNTRY").agg({"PRICE": "sum"})

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

* § Soru 7: SOURCE türlerine göre satış sayıları nedir?

In [20]:

df["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

* § Soru 8: Ülkelere göre PRICE ortalamaları nedir?

In [21]:
df.groupby("COUNTRY").agg({"PRICE": "mean"})

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

* § Soru 9: SOURCE'lara göre PRICE ortalamaları nedir?

In [22]:
df.groupby("SOURCE").agg({"PRICE": "mean"})

             PRICE
SOURCE
android  34.174849
ios      34.069102

* § Soru 10: COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [23]:
df.groupby(by=["COUNTRY","SOURCE"]).agg({"PRICE": "mean"})

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

**GÖREV 2**

* COUNTRY,SOURCE, SEX, AGE kırılımında ortalama kazançlar nelerdir.?

In [24]:
df.groupby(["COUNTRY", 'SOURCE', "SEX", "AGE"]).agg({"PRICE": "mean"}).head()

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897

* Çıktıyı “PRICE” değişkenine göre sıralayalım.

In [25]:
dff = df.groupby(by=["COUNTRY", 'SOURCE', "SEX", "AGE"]).agg({"PRICE": "mean"}).sort_values("PRICE", ascending=False)
dff.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

* Index’te yer alan isimleri değişken ismine çevirelim.

In [26]:
dff = dff.reset_index()
dff.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

* AGE değişkenini kategorik değişkene çevirelim ve dff’e ekleyelim.

In [27]:
count_by  = [0, 18, 23, 30, 40, dff["AGE"].max()]
labels_  = ['0_18', '19_23', '24_30', '31_40', '41_' + str(dff["AGE"].max())]

In [28]:
dff["AGE_CAT"] = pd.cut(dff["AGE"], count_by, labels=labels_ )
dff.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46   59.0   41_66
1     usa  android    male   36   59.0   31_40
2     fra  android  female   24   59.0   24_30
3     usa      ios    male   32   54.0   31_40
4     deu  android  female   36   49.0   31_40

* Yeni seviye tabanlı müşterileri(persona) tanımlayınız.

In [29]:
dff["CUSTOMERS_LEVEL_BASED"] = [row[0].upper() + "_" + row[1].upper() + "_" + row[2].upper() + "_" + row[5].upper() for row in dff.values]
dff.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT     CUSTOMERS_LEVEL_BASED
0     bra  android    male   46   59.0   41_66    BRA_ANDROID_MALE_41_66
1     usa  android    male   36   59.0   31_40    USA_ANDROID_MALE_31_40
2     fra  android  female   24   59.0   24_30  FRA_ANDROID_FEMALE_24_30
3     usa      ios    male   32   54.0   31_40        USA_IOS_MALE_31_40
4     deu  android  female   36   49.0   31_40  DEU_ANDROID_FEMALE_31_40

* Kullandığımız değişkenlerden kurtulalım.

In [30]:
dff = dff[["CUSTOMERS_LEVEL_BASED", "PRICE"]]
dff.head()

      CUSTOMERS_LEVEL_BASED  PRICE
0    BRA_ANDROID_MALE_41_66   59.0
1    USA_ANDROID_MALE_31_40   59.0
2  FRA_ANDROID_FEMALE_24_30   59.0
3        USA_IOS_MALE_31_40   54.0
4  DEU_ANDROID_FEMALE_31_40   49.0

In [31]:
dff = dff.groupby("CUSTOMERS_LEVEL_BASED").agg({"PRICE": "mean"})
dff = dff.reset_index()
dff.head()

      CUSTOMERS_LEVEL_BASED      PRICE
0   BRA_ANDROID_FEMALE_0_18  35.645303
1  BRA_ANDROID_FEMALE_19_23  34.077340
2  BRA_ANDROID_FEMALE_24_30  33.863946
3  BRA_ANDROID_FEMALE_31_40  34.898326
4  BRA_ANDROID_FEMALE_41_66  36.737179

* Yeni müşterileri (USA_ANDROID_MALE_0_18) segmentlere ayırırız.

In [32]:
dff["SEGMENT"] = pd.qcut(dff["PRICE"], 4, labels=["A", "B", "C", "D"])
dff.head()

      CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
0   BRA_ANDROID_FEMALE_0_18  35.645303       C
1  BRA_ANDROID_FEMALE_19_23  34.077340       B
2  BRA_ANDROID_FEMALE_24_30  33.863946       B
3  BRA_ANDROID_FEMALE_31_40  34.898326       C
4  BRA_ANDROID_FEMALE_41_66  36.737179       D

* Segmentlerin betimsel istatistiklerini(ortalama, maksimum değer, toplam) inceleyelim .

In [33]:
dff.groupby("SEGMENT").agg({"PRICE": ["mean","max","sum"]})

             PRICE
              mean        max          sum
SEGMENT
A        29.206780  32.333333   817.789833
B        33.509674  34.077340   904.761209
C        34.999645  36.000000   944.990411
D        38.691234  45.428571  1044.663328

Yeni gelen müşterileri sınıflandırıp, ne kadar gelir getirebileceklerini tahmin etmek üzere bir kaç örnek verelim.
* 33 yaşında ANDROID kullanan bir Türk kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

In [34]:
new_customer= "TUR_ANDROID_FEMALE_31_40"
dff[dff["CUSTOMERS_LEVEL_BASED"] == new_customer]

       CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
72  TUR_ANDROID_FEMALE_31_40  41.833333       D

* 35 yaşında IOS kullanan bir Fransız kadını hangi segmente ve ortalama ne kadar gelir kazandırması beklenir?

In [35]:
new_customer = "FRA_IOS_FEMALE_31_40"
dff[dff["CUSTOMERS_LEVEL_BASED"] == new_customer]

   CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
63  FRA_IOS_FEMALE_31_40  32.818182       B

* new_customer = "USA_IOS_MALE_24_30"
dff[dff["CUSTOMERS_LEVEL_BASED"] == new_customer]24 IOS kullanan bir Amerikan erkeği hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

In [36]:
new_customer = "USA_IOS_MALE_24_30"
dff[dff["CUSTOMERS_LEVEL_BASED"] == new_customer]

    CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
106    USA_IOS_MALE_24_30  34.838143       C

In [37]:
dff

        CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
0     BRA_ANDROID_FEMALE_0_18  35.645303       C
1    BRA_ANDROID_FEMALE_19_23  34.077340       B
2    BRA_ANDROID_FEMALE_24_30  33.863946       B
3    BRA_ANDROID_FEMALE_31_40  34.898326       C
4    BRA_ANDROID_FEMALE_41_66  36.737179       D
..                        ...        ...     ...
104         USA_IOS_MALE_0_18  33.983495       B
105        USA_IOS_MALE_19_23  34.901872       C
106        USA_IOS_MALE_24_30  34.838143       C
107        USA_IOS_MALE_31_40  36.206324       D
108        USA_IOS_MALE_41_66  35.750000       C

[109 rows x 3 columns]